husker52/ArduinoCore-frdm-kl25z/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA


# FRDM-KL25Z (Programming Port)
# ---------------------------------------
arduino_frdm_edbg.name=FRDM-KL25Z (Programming Port)
arduino_frdm_edbg.vid.0=0xc251
arduino_frdm_edbg.pid.0=0xf002

arduino_frdm_edbg.upload.tool=openocd
arduino_frdm_edbg.upload.protocol=sam-ba
arduino_frdm_edbg.upload.maximum_size=131072
arduino_frdm_edbg.upload.use_1200bps_touch=false
arduino_frdm_edbg.upload.wait_for_upload_port=false
arduino_frdm_edbg.upload.native_usb=false
arduino_frdm_edbg.build.mcu=cortex-m0plus
arduino_frdm_edbg.build.f_cpu=48000000L
arduino_frdm_edbg.build.usb_product="Keil Software OpenSDA CMSIS-DAP"
arduino_frdm_edbg.build.usb_manufacturer="Freescale"
arduino_frdm_edbg.build.board=FRDM-KL25Z
arduino_frdm_edbg.build.core=arduino
arduino_frdm_edbg.build.extra_flags=
arduino_frdm_edbg.build.ldscript=linker_scripts/linker.ld
arduino_frdm_edbg.build.openocdscript=openocd_scripts/frdm-kl25z.cfg
arduino_frdm_edbg.build.variant=frdm-kl25z
arduino_frdm_edbg.build.variant_system_lib=
arduino_frdm_edbg.build.vid=0xc251
arduino_frdm_edbg.build.pid=0xf002
arduino_frdm_edbg.bootloader.tool=openocd
arduino_frdm_edbg.bootloader.file=zero/samd21_sam_ba.bin

